; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   cabinettype bathtubbasintype carttype desktype laundryhampertype shelftype garbagecantype - receptacletype
   platetype potatotype statuetype glassbottletype watchtype spoontype winebottletype pantype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   cabinet_1 bathtubbasin_2 cart_3 desk_4 laundryhamper_5 shelf_6 garbagecan_7 sinkbasin_8 microwave_9 fridge_10 - receptacle
   plate_1 potato_2 statue_3 glassbottle_4 watch_5 spoon_6 winebottle_7 pan_8 - obj
 )
 (:init (receptacletype_0 cabinet_1 cabinettype) (receptacletype_0 bathtubbasin_2 bathtubbasintype) (receptacletype_0 cart_3 carttype) (receptacletype_0 desk_4 desktype) (receptacletype_0 laundryhamper_5 laundryhampertype) (receptacletype_0 shelf_6 shelftype) (receptacletype_0 garbagecan_7 garbagecantype) (receptacletype_0 sinkbasin_8 sinkbasintype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 plate_1 platetype) (objecttype_0 potato_2 potatotype) (objecttype_0 statue_3 statuetype) (objecttype_0 glassbottle_4 glassbottletype) (objecttype_0 watch_5 watchtype) (objecttype_0 spoon_6 spoontype) (objecttype_0 winebottle_7 winebottletype) (objecttype_0 pan_8 pantype) (cancontain cabinettype platetype) (cancontain cabinettype glassbottletype) (cancontain cabinettype winebottletype) (cancontain cabinettype pantype) (cancontain carttype statuetype) (cancontain desktype platetype) (cancontain desktype statuetype) (cancontain desktype glassbottletype) (cancontain desktype watchtype) (cancontain desktype winebottletype) (cancontain shelftype platetype) (cancontain shelftype statuetype) (cancontain shelftype glassbottletype) (cancontain shelftype watchtype) (cancontain shelftype winebottletype) (cancontain garbagecantype potatotype) (cancontain garbagecantype winebottletype) (cancontain sinkbasintype platetype) (cancontain sinkbasintype potatotype) (cancontain sinkbasintype glassbottletype) (cancontain sinkbasintype spoontype) (cancontain sinkbasintype pantype) (cancontain microwavetype platetype) (cancontain microwavetype potatotype) (cancontain microwavetype glassbottletype) (cancontain fridgetype platetype) (cancontain fridgetype potatotype) (cancontain fridgetype glassbottletype) (cancontain fridgetype winebottletype) (cancontain fridgetype pantype) (pickupable plate_1) (isreceptacleobject plate_1) (cleanable plate_1) (heatable plate_1) (coolable plate_1) (pickupable potato_2) (cleanable potato_2) (heatable potato_2) (coolable potato_2) (sliceable potato_2) (pickupable statue_3) (pickupable glassbottle_4) (pickupable watch_5) (pickupable spoon_6) (cleanable spoon_6) (pickupable winebottle_7) (pickupable pan_8) (isreceptacleobject pan_8) (cleanable pan_8) (coolable pan_8) (receptacleatlocation cabinet_1 location8) (receptacleatlocation bathtubbasin_2 location5) (receptacleatlocation cart_3 location4) (receptacleatlocation desk_4 location2) (receptacleatlocation laundryhamper_5 location6) (receptacleatlocation shelf_6 location1) (receptacleatlocation garbagecan_7 location1) (receptacleatlocation sinkbasin_8 location1) (receptacleatlocation microwave_9 location1) (receptacleatlocation fridge_10 location7) (inreceptacle plate_1 desk_4) (inreceptacle potato_2 garbagecan_7) (inreceptacle statue_3 desk_4) (inreceptacle glassbottle_4 sinkbasin_8) (inreceptacle watch_5 desk_4) (inreceptacle spoon_6 sinkbasin_8) (inreceptacle winebottle_7 cabinet_1) (inreceptacle pan_8 fridge_10) (objectatlocation plate_1 location2) (objectatlocation potato_2 location1) (objectatlocation statue_3 location2) (objectatlocation glassbottle_4 location1) (objectatlocation watch_5 location2) (objectatlocation spoon_6 location1) (objectatlocation winebottle_7 location8) (objectatlocation pan_8 location7) (atlocation agent1 location8) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (coolable ?o) (objecttype_0 ?o platetype) (receptacletype_0 ?r sinkbasintype) (iscool ?o) (inreceptacle ?o ?r))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location8 location2)
   deleted: (atlocation agent1 location8)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
2. (pickupobject agent1 location2 plate_1 desk_4)
   deleted: (inreceptacle plate_1 desk_4) (objectatlocation plate_1 location2)
   added: (holds agent1 plate_1) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 location2 location7)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location7)
   goals met: 0 of 1
4. (coolobject agent1 location7 fridge_10 plate_1)
   added: (iscool plate_1)
   goals met: 0 of 1
5. (gotolocation agent1 location7 location1)
   deleted: (atlocation agent1 location7)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
6. (putobject agent1 location1 plate_1 sinkbasin_8 platetype sinkbasintype)
   deleted: (holds agent1 plate_1) (holdsany agent1)
   added: (inreceptacle plate_1 sinkbasin_8) (objectatlocation plate_1 location1)
   goals met: 1 of 1
